MacOSX27.0.sdk/usr/share/man/man2/aio_write.2
.\" Copyright (c) 1999 Softweyr LLC.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Softweyr LLC AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Softweyr LLC OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/lib/libc/sys/aio_write.2,v 1.16 2003/01/13 10:37:11 tjr Exp $
.\"
.Dd September 18, 2008
.Dt AIO_WRITE 2
.Os
.Sh NAME
.Nm aio_write ,
.Nm aio_writev
.Nd asynchronous write to a file (REALTIME)
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In aio.h
.Ft int
.Fo aio_write
.Fa "struct aiocb *aiocbp"
.Fc
.In sys/uio.h
.Ft int
.Fo aio_writev
.Fa "struct aiocb *aiocbp"
.Fc
.Sh DESCRIPTION
The
.Fn aio_write
system call allows the calling process to write
.Fa aiocbp->aio_nbytes
from the buffer pointed to by
.Fa aiocbp->aio_buf
to the descriptor
.Fa aiocbp->aio_fildes .
.Pp
The
.Fn aio_writev
system call allows the calling process to write data from multiple buffers
(vectored I/O) to the descriptor
.Fa aiocbp->aio_fildes .
For
.Fn aio_writev ,
the
.Fa aiocbp->aio_iov
field points to an array of
.Vt "struct iovec"
structures, and
.Fa aiocbp->aio_iovcnt
specifies the number of elements in this array.
Each
.Vt iovec
structure specifies a buffer and its length for the write operation.
.Pp
The
.Fn aio_writev
function can also be used with
.Xr lio_listio 2
by setting the
.Fa aio_lio_opcode
field to
.Dv LIO_WRITEV .
.Pp
Both calls return immediately after the write request has been enqueued
to the descriptor; the write may or may not have completed at the time
the call returns.  If the request could not be enqueued, generally due
to invalid arguments, the call returns without having enqueued the
request.
.Pp
If
.Dv O_APPEND
is set for
.Fa aiocbp->aio_fildes ,
.Fn aio_write
and
.Fn aio_writev
operations append to the file in the same order as the calls were
made.  If
.Dv O_APPEND
is not set for the file descriptor, the write operation will occur at
the absolute position from the beginning of the file plus
.Fa aiocbp->aio_offset .
.Pp
If
.Dv _POSIX_PRIORITIZED_IO
is defined, and the descriptor supports it, then the enqueued
operation is submitted at a priority equal to that of the calling
process minus
.Fa aiocbp->aio_reqprio .
.Pp
The
.Fa aiocbp
pointer may be subsequently used as an argument to
.Fn aio_return
and
.Fn aio_error
in order to determine return or error status for the enqueued operation
while it is in progress.
.Pp
If the request is successfully enqueued, the value of
.Fa aiocbp->aio_offset
can be modified during the request as context, so this value must not
be referenced after the request is enqueued.
.Pp
All asynchronous I/O control buffers contain a
.Vt sigevent
structure in the
.Va aio_sigevent
field which can be used to request notification when an operation completes.
.Pp
For
.Dv SIGEV_KEVENT
notifications, the
.Va sigev_notify
field should be set to
.Dv SIGEV_KEVENT,
and its
.Va sigevent
.Ap
s
.Va sigev_signo
field should contain the descriptor of the kqueue that the event should be
attached to. The posted kevent will contain:
.Bl -column ".Va filter"
.It Sy Member Ta Sy Value
.It Va ident Ta asynchronous I/O control buffer pointer
.It Va filter Ta Dv EVFILT_AIO
.It Va udata Ta
value stored in
.Fa aiocbp->aio_sigevent.sigev_value
.El
.Sh RESTRICTIONS
The Asynchronous I/O Control Block structure pointed to by
.Fa aiocbp
and the buffer that the
.Fa aiocbp->aio_buf
member of that structure references must remain valid until the
operation has completed.  For this reason, use of auto (stack) variables
for these objects is discouraged.
.Pp
For
.Fn aio_writev ,
the array of
.Vt "struct iovec"
structures pointed to by
.Fa aiocbp->aio_buf
and all buffers referenced by the
.Fa iov_base
members of those structures must remain valid until the operation completes.
.Pp
The asynchronous I/O control buffer
.Fa aiocbp
should be zeroed before the
.Fn aio_write
or
.Fn aio_writev
system call to avoid passing bogus context information to the kernel.
.Pp
Modifications of the Asynchronous I/O Control Block structure or the
buffer contents after the request has been enqueued, but before the
request has completed, are not allowed.
.Pp
If the file offset in
.Fa aiocbp->aio_offset
is past the offset maximum  for
.Fa aiocbp->aio_fildes ,
no I/O will occur.
.Sh RETURN VALUES
.Rv -std aio_write aio_writev
.Sh ERRORS
The
.Fn aio_write
and
.Fn aio_writev
system calls will fail if:
.Bl -tag -width Er
.\" ==========
.It Bq Er EAGAIN
Due to system resource limitations,
the request was not queued.
.\" ==========
.It Bq Er ENOSYS
The
.Fn aio_write
or
.Fn aio_writev
system call is not supported.
.El
.Pp
The following conditions may be synchronously detected when the
.Fn aio_write
or
.Fn aio_writev
system call is made, or asynchronously, at any time thereafter.  If they
are detected at call time,
.Fn aio_write
or
.Fn aio_writev
returns -1 and sets
.Va errno
appropriately; otherwise the
.Fn aio_return
system call must be called, and will return -1, and
.Fn aio_error
must be called to determine the actual value that would have been
returned in
.Va errno .
.Pp
.Bl -tag -width Er
.\" ==========
.It Bq Er EFAULT
Failed to transfer the asynchronous I/O control buffer
.Fa aiocbp
into the kernel's memory space, possibly due to an invalid or incorrect address.
.\" ==========
.It Bq Er EBADF
The
.Fa aiocbp->aio_fildes
argument
is invalid, or is not opened for writing.
.\" ==========
.It Bq Er EINVAL
The offset
.Fa aiocbp->aio_offset
is not valid.
.\" ==========
.It Bq Er EINVAL
The priority specified by
.Fa aiocbp->aio_reqprio
is not a valid priority.
.\" ==========
.It Bq Er EINVAL
The number of bytes specified by
.Fa aiocbp->aio_nbytes
is not valid.
.El
.Pp
The
.Fn aio_writev
calls may also return one of the following errors:
.Bl -tag -width Er
.\" ==========
.It Bq Er EFAULT
Part of the
.Fa aio_iov
points outside the process's allocated address space.
.\" ==========
.It Bq Er EINVAL
.Fa aio_iovcnt
was less than or equal to 0, or greater than
.Dv AIO_UIO_MAXIOV .
.\" ==========
.It Bq Er EINVAL
One of the
.Fa iov_len
values in the
.Fa aio_iov
array was negative.
.\" ==========
.It Bq Er EINVAL
The sum of the
.Fa iov_len
values in the
.Fa aio_iov
array overflowed a 32-bit integer.
.\" ==========
.It Bq Er EINVAL
The constant in
.Fa aiocbp->aio_sigevent.sigev_notify
is set to SIGEV_THREAD (SIGEV_THREAD is not supported).
.El
.Pp
If the request is successfully enqueued, but subsequently canceled
or an error occurs, the value returned by the
.Fn aio_return
system call is per the
.Xr write 2
system call, and the value returned by the
.Fn aio_error
system call is either one of the error returns from the
.Xr write 2
system call, or one of:
.Bl -tag -width Er
.\" ==========
.It Bq Er EBADF
The
.Fa aiocbp->aio_fildes
argument
is invalid for writing.
.\" ==========
.It Bq Er ECANCELED
The request was explicitly canceled via a call to
.Fn aio_cancel .
.El
.Sh SEE ALSO
.Xr aio_cancel 2 ,
.Xr aio_error 2 ,
.Xr aio_return 2 ,
.Xr aio_suspend 2 ,
.Xr aio 4
.Sh STANDARDS
The
.Fn aio_write
system call
is expected to conform to the
.St -p1003.1
standard.
The
.Fn aio_writev
system call is an extension to the
.St -p1003.1
standard.
.Sh HISTORY
The
.Fn aio_write
system call first appeared in
.Fx 3.0 .
The
.Fn aio_writev
system call first appeared in Mac OS X 27.0.
.Sh AUTHORS
This manual page was written by
.An Wes Peters Aq wes@softweyr.com .
.Sh BUGS
Invalid information in
.Fa aiocbp->_aiocb_private
may confuse the kernel.
