MacOSX27.0.sdk/usr/share/man/man2/chflags.2
.\"	$NetBSD: chflags.2,v 1.6 1995/02/27 12:32:03 cgd Exp $
.\"
.\" Copyright (c) 1989, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)chflags.2	8.1 (Berkeley) 6/9/93
.\"
.Dd June 9, 1993
.Dt CHFLAGS 2
.Os
.Sh NAME
.Nm chflags ,
.Nm fchflags ,
.Nm fchflagsat
.Nd set file flags
.Sh SYNOPSIS
.Fd #include <sys/stat.h>
.Fd #include <unistd.h>
.Ft int
.Fn chflags "const char *path"  "u_int flags"
.Ft int
.Fn fchflags "int fd" "u_int flags"
.Ft int
.Fn fchflagsat "int fd" "const char *path" "u_int flags" "int flag"
.Sh DESCRIPTION
The file whose name
is given by
.Fa path
or referenced by the descriptor
.Fa fd
has its flags changed to
.Fa flags .
.Pp
The
.Fn fchflagsat
is equivalent to
.Fn chflag
except in the case where
.Fa path
specifies a relative path.
In this case the file to be changed is determined relative to the directory
associated with the file descriptor
.Fa fd
instead of the current working directory.
The values for the
.Fa flag
are constructed by a bitwise-inclusive OR of flags from the following list, defined
in
.In fcntl.h :
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_SYMLINK_NOFOLLOW
If
.Fa path
names a symbolic link, then the flags of the symbolic link is changed.
.El
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_SYMLINK_NOFOLLOW_ANY
If
.Fa path
names a symbolic link, then the flags of the symbolic link is changed and
if the path has any other symbolic links, an error is returned.
.El
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_RESOLVE_BENEATH
If
.Fa path
does not reside in the hierarchy beneath the starting directory,
an error is returned.
.El
.Pp
If
.Fn fchflagsat
is passed the special value
.Dv AT_FDCWD
in the
.Fa fd
parameter, the current working directory is used.
If also
.Fa flag
is zero, the behavior is identical to a call to
.Fn chflags .
.Pp
The flags specified are formed by
.Em or Ns 'ing
the following values
.Pp
.Bl -tag -width "SF_IMMUTABLEX" -compact -offset indent
.It UF_NODUMP
Do not dump the file.
.It UF_IMMUTABLE
The file may not be changed.
.It UF_APPEND
The file may only be appended to.
.It UF_OPAQUE
The directory is opaque when viewed through a union stack.
.It UF_HIDDEN
The file or directory is not intended to be displayed to the user.
.It UF_COMPRESSED
File is compressed at the file system level.
.It SF_ARCHIVED
The file has been archived.
.It SF_IMMUTABLE
The file may not be changed.
.It SF_APPEND
The file may only be appended to.
.It SF_DATALESS 
The file is a dataless placeholder.
The system will attempt to materialize it when accessed according to the dataless file materialization policy of the accessing thread or process.
See
.Xr getiopolicy_np 3 .
.El
.Pp
The
.Dq UF_IMMUTABLE ,
.Dq UF_APPEND ,
.Dq UF_OPAQUE ,
and
.Dq UF_HIDDEN
flags may be set or unset by either the owner of a file or the super-user.
.Pp
The
.Dq SF_ARCHIVED ,
.Dq SF_IMMUTABLE
and
.Dq SF_APPEND
flags may only be set or unset by the super-user.
.Pp
The
.Dq SF_DATALESS
and
.Dq UF_COMPRESSED
flags are internal flags and may not be set or unset from user space.  Attempting to modify them using
.Fn chflags
will result in undefined behaviour.
.Sh RETURN VALUES
Upon successful completion, a value of 0 is returned.
Otherwise, -1 is returned and the global variable
.Va errno
is set to indicate the error.
.Sh ERRORS
.Fn chflags
will fail if:
.Bl -tag -width Er
.It Bq Er ENOTDIR
A component of the path prefix is not a directory.
.It Bq Er ENAMETOOLONG
A component of a pathname exceeded 
.Dv {NAME_MAX}
characters, or an entire path name exceeded 
.Dv {PATH_MAX}
characters.
.It Bq Er ENOENT
The named file does not exist.
.It Bq Er EACCES
Search permission is denied for a component of the path prefix.
.It Bq Er ELOOP
Too many symbolic links were encountered in translating the pathname.
.It Bq Er EPERM
The effective user ID does not match the owner of the file and
the effective user ID is not the super-user.
.It Bq Er EROFS
The named file resides on a read-only file system.
.It Bq Er EFAULT
.Fa Path
points outside the process's allocated address space.
.It Bq Er EIO
An
.Tn I/O
error occurred while reading from or writing to the file system.
.It Bq Er ENOTSUP
The operation isn't supported by the filesystem.
.El
.Pp
.Fn fchflags
will fail if:
.Bl -tag -width Er
.It Bq Er EBADF
The descriptor is not valid.
.It Bq Er EINVAL
.Fa fd
refers to a socket, not to a file.
.It Bq Er EPERM
The effective user ID does not match the owner of the file and
the effective user ID is not the super-user.
.It Bq Er EROFS
The file resides on a read-only file system.
.It Bq Er EIO
An
.Tn I/O
error occurred while reading from or writing to the file system.
.It Bq Er ENOTSUP
The operation isn't supported by the filesystem.
.El
.Pp
In addition to the
.Fn chflags
errors,
.Fn fchflagsat
fails if:
.Bl -tag -width Er
.It Bq Er EBADF
The
.Fa path
argument does not specify an absolute path and the
.Fa fd
argument is neither
.Fa AT_FDCWD
nor a valid file descriptor open for searching.
.It Bq Er EINVAL
The value of the
.Fa flag
argument is not valid.
.It Bq Er ELOOP
If AT_SYMLINK_NOFOLLOW_ANY was passed and a symbolic link was encountered
in translating the pathname.
.It Bq Er ENOTDIR
The
.Fa path
argument is not an absolute path and
.Fa fd
is neither
.Dv AT_FDCWD
nor a file descriptor associated with a directory.
.It Bq Er ENOTCAPABLE
if AT_RESOLVE_BENEATH was passed and
.Fa path
does not reside in the directory hierarchy beneath the starting directory.
.Sh SEE ALSO
.Xr chflags 1 ,
.Xr fflagstostr 3 ,
.Xr lchflags 3 ,
.Xr strtofflags 3 ,
.Xr launchd 8
.Sh HISTORY
The
.Fn chflags
and
.Nm fchflags
functions first appeared in 4.4BSD.
.Fn fchflagsat
system call appeared in macOS 27.0.
