MacOSX27.0.sdk/usr/share/man/man8/FindMySecureEnvironmentXPCService.8
.\"Copyright (c) 2026 Apple Inc. All Rights Reserved.
.Dd April 14, 2026
.Dt FindMySecureEnvironmentXPCService 8
.Os "Mac OS X"
.Sh NAME
.Nm FindMySecureEnvironmentXPCService
.Nd Find My secure environment XPC service
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
is an XPC service that provides authenticated access to Apple-internal
secure environment endpoints on behalf of Find My clients.
It handles AppleConnect OAuth authentication, session token management,
and authenticated request forwarding so that client processes do not
require direct access to authentication credentials.
.Pp
The service is launched on demand by
.Xr launchd 8
when a client connects to its Mach service and idle-exits when no
connections remain.
.Pp
There are no configuration options to
.Nm .
Users should not run it manually.
.Ss Authentication Flow
When a client sends a request, the service:
.Bl -enum -offset indent
.It
Obtains an AppleConnect OAuth authorization code via
.Sy AppleConnectClient.framework .
.It
Exchanges the authorization code for a session token from the secure
environment token endpoint.
.It
Caches the session token for subsequent requests.
.It
Injects the session token and environment headers into the client's
request and forwards it to the backend.
.It
Returns the response data and HTTP response directly to the client.
.El
.Pp
If the backend returns HTTP 401, the service invalidates its cached
token and AppleConnect ticket, re-authenticates, and retries the
request once before returning the error.
.Ss XPC Interface
The service exports two methods via the
.Sy SecureEnvironmentXPCProtocol
interface:
.Bl -tag -width indent
.It Ic fetchSecureEnvironmentToken
Authenticates and returns a session token string.
Primarily used for diagnostics via
.Xr sptool 8 .
.It Ic performAuthenticatedRequest
Accepts an
.Vt NSURLRequest ,
injects authentication headers, forwards the request,
and replies with the response data and
.Vt NSURLResponse .
.El
.Sh ENTITLEMENTS
Clients must possess the
.Sy com.apple.findmy.secureenvironment.client
entitlement and declare a Mach service lookup for
.Sy com.apple.findmy.secureenvironment
in their entitlements file.
Connections without the entitlement are rejected.
.Sh MACH SERVICE
.Sy com.apple.findmy.secureenvironment
.Sh FILES
.Bl -tag -width indent
.It Pa /System/Library/PrivateFrameworks/FindMySecureEnvironment.framework/XPCServices/FindMySecureEnvironmentXPCService.xpc
Service bundle.
.It Pa /System/Library/LaunchDaemons/com.apple.findmy.secureenvironment.plist
.Xr launchd.plist 5
configuration.
.El
.Sh SEE ALSO
.Xr launchd 8 ,
.Xr searchpartyd 8 ,
.Xr searchpartyuseragent 8 ,
.Xr sptool 8 ,
.Xr launchd.plist 5
